content/python/python-summary.org
# -*- coding:utf-8; -*-
# -*- coding:utf-8-*-
#+TITLE: python summary
#+AUTHOR: liushangliang
#+EMAIL: phenix3443+github@gmail.com
#+STARTUP: overview

* 简介
** 起源
** 优点
   + 上手方便，用来写程序原型特别方便。
   + 代码库很全面。
** 特性
   动态类型以及多态性是 Python 语言灵活性的根源。每个对象都有两个标准的头部信息：类型标志符和引用计数器。
** 语言文化
** 编码规范
*** 注释
* 安装运行
** 安装
** 运行
* 相关工具
** 标准命令
** 集成开发
** 代码检查
** 构建编译
** 代码调试
** 自动测试
** 性能分析
** 文档系统
** 包管理系统
*** easy_install
*** pip
    使用豆瓣作为软件源镜像：
    #+BEGIN_SRC sh
vim $HOME/.config/pip/pip.conf
    #+END_SRC


    #+BEGIN_EXAMPLE
[global]
timeout = 60
index-url = https://pypi.doubanio.com/simple
    #+END_EXAMPLE


** 其他工具
* 工程布局
* 程序结构
** 函数
*** 参数
*** 返回值
** 标识符
*** 常量
    + 数字
    + 字符串
    + 元组
*** 变量
    + 列表
    + 字典
*** 动态绑定
*** 作用域
* 类型系统
** 基本类型
*** 布尔(bool)
*** 数字(numeric)
    int()
*** 字符串(string)
    str()
** 复合类型
*** 元组（tuple）
*** 列表（list）
*** 字典（dict）
** 默认值
** 类型转换
* 运算符
** 算数运算符
** 逻辑运算符
** 位运算符
** 通信操作符
* 表达式
** 赋值表达式
   多变量赋值
* 分支控制
** 判断
** 循环
** 跳转

* 编程范式
** 面向对象
   python 本身支持类模型。
*** 封装
