docs/python/python-summary.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-26 日 10:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>python summary</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">python summary</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd9caa57">1. 简介</a>
<ul>
<li><a href="#orgb22b6bc">1.1. 起源</a></li>
<li><a href="#org7e13537">1.2. 优点</a></li>
<li><a href="#orgb74a78b">1.3. 特性</a></li>
<li><a href="#org63e7bbf">1.4. 语言文化</a></li>
<li><a href="#org545bb9d">1.5. 编码规范</a>
<ul>
<li><a href="#org4407ab7">1.5.1. 注释</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2db4294">2. 安装运行</a>
<ul>
<li><a href="#org692254c">2.1. 安装</a></li>
<li><a href="#org5441cc9">2.2. 运行</a></li>
</ul>
</li>
<li><a href="#orgc7ff8bd">3. 相关工具</a>
<ul>
<li><a href="#org015357a">3.1. 标准命令</a></li>
<li><a href="#org25866bc">3.2. 集成开发</a></li>
<li><a href="#orga0370c0">3.3. 代码检查</a></li>
<li><a href="#orgdc4bb45">3.4. 构建编译</a></li>
<li><a href="#org30adfd5">3.5. 代码调试</a></li>
<li><a href="#orgd5b236b">3.6. 自动测试</a></li>
<li><a href="#org4aad955">3.7. 性能分析</a></li>
<li><a href="#org0d24c06">3.8. 文档系统</a></li>
<li><a href="#org77b229c">3.9. 包管理系统</a>
<ul>
<li><a href="#org0647645">3.9.1. easy_install</a></li>
<li><a href="#orgf216a16">3.9.2. pip</a></li>
</ul>
</li>
<li><a href="#org7cba7dc">3.10. 其他工具</a></li>
</ul>
</li>
<li><a href="#org099de71">4. 工程布局</a></li>
<li><a href="#org0e1381e">5. 程序结构</a>
<ul>
<li><a href="#org705e358">5.1. 函数</a>
<ul>
<li><a href="#org1e98a16">5.1.1. 参数</a></li>
<li><a href="#org7c588bf">5.1.2. 返回值</a></li>
</ul>
</li>
<li><a href="#orgf25c067">5.2. 标识符</a>
<ul>
<li><a href="#org3d4f209">5.2.1. 常量</a></li>
<li><a href="#org6d808f9">5.2.2. 变量</a></li>
<li><a href="#org81ca1bd">5.2.3. 动态绑定</a></li>
<li><a href="#orgeb2b3a6">5.2.4. 作用域</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgfe3d1a6">6. 类型系统</a>
<ul>
<li><a href="#org794b31b">6.1. 基本类型</a>
<ul>
<li><a href="#org993a688">6.1.1. 布尔(bool)</a></li>
<li><a href="#org7a1e078">6.1.2. 数字(numeric)</a></li>
<li><a href="#org52b2e75">6.1.3. 字符串(string)</a></li>
</ul>
</li>
<li><a href="#org323ebcd">6.2. 复合类型</a>
<ul>
<li><a href="#org4cb1b23">6.2.1. 元组（tuple）</a></li>
<li><a href="#orgf0005c6">6.2.2. 列表（list）</a></li>
<li><a href="#org3f7142a">6.2.3. 字典（dict）</a></li>
</ul>
</li>
<li><a href="#org86a2fe1">6.3. 默认值</a></li>
<li><a href="#orgdf02b65">6.4. 类型转换</a></li>
</ul>
</li>
<li><a href="#org6004297">7. 运算符</a>
<ul>
<li><a href="#org1f8ee3b">7.1. 算数运算符</a></li>
<li><a href="#org529854e">7.2. 逻辑运算符</a></li>
<li><a href="#org8441117">7.3. 位运算符</a></li>
<li><a href="#org0f5bec3">7.4. 通信操作符</a></li>
</ul>
</li>
<li><a href="#orgce900ea">8. 表达式</a>
<ul>
<li><a href="#orgbe6573e">8.1. 赋值表达式</a></li>
</ul>
</li>
<li><a href="#org58362ec">9. 分支控制</a>
<ul>
<li><a href="#org9b966a1">9.1. 判断</a></li>
<li><a href="#org7caec71">9.2. 循环</a></li>
<li><a href="#org117790f">9.3. 跳转</a></li>
</ul>
</li>
<li><a href="#orgc97d1de">10. 编程范式</a>
<ul>
<li><a href="#orgdcbb15c">10.1. 面向对象</a>
<ul>
<li><a href="#org01f57f7">10.1.1. 封装</a></li>
<li><a href="#org4e8ee95">10.1.2. 继承</a>
<ul>
<li><a href="#org13089d3">10.1.2.1. 类变量</a></li>
<li><a href="#org64156ba">10.1.2.2. 实例变量</a></li>
<li><a href="#org31ebaf1">10.1.2.3. 类方法</a></li>
<li><a href="#org8b97def">10.1.2.4. 成员方法</a></li>
<li><a href="#orgc325bd7">10.1.2.5. 静态方法</a></li>
<li><a href="#org73ba82b">10.1.2.6. 构造函数</a></li>
<li><a href="#org2683655">10.1.2.7. 析构函数</a></li>
</ul>
</li>
<li><a href="#orgf137e23">10.1.3. 多态</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd4fd433">11. 程序库</a>
<ul>
<li><a href="#org0f7266c">11.1. 操作系统</a></li>
<li><a href="#org32ed9d1">11.2. 测试</a>
<ul>
<li><a href="#org2726796">11.2.1. deepdiff</a></li>
<li><a href="#org1020324">11.2.2. unittest</a></li>
</ul>
</li>
<li><a href="#org989ce71">11.3. 密码学</a>
<ul>
<li><a href="#orga57185e">11.3.1. hashlib</a></li>
<li><a href="#org9fac4f0">11.3.2. pycryto</a></li>
</ul>
</li>
<li><a href="#orgd69746c">11.4. 国际化</a></li>
<li><a href="#org1c97d28">11.5. 配置</a></li>
<li><a href="#org5d268c9">11.6. 日期</a></li>
<li><a href="#orgfbd416a">11.7. 日志</a>
<ul>
<li><a href="#orgd809285">11.7.1. logging</a></li>
</ul>
</li>
<li><a href="#org5eb883b">11.8. 数据库</a>
<ul>
<li><a href="#org9aa6316">11.8.1. mysql</a>
<ul>
<li><a href="#orgaa64661">11.8.1.1. MySQL-db</a></li>
<li><a href="#org3d88769">11.8.1.2. mysql-connector</a></li>
</ul>
</li>
<li><a href="#orgb49da68">11.8.2. redis</a></li>
</ul>
</li>
<li><a href="#org2e058aa">11.9. 序列化</a>
<ul>
<li><a href="#org9f300a7">11.9.1. struct</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org731a486">12. 参考书籍</a>
<ul>
<li><a href="#org41b18dc">12.1. 入门</a></li>
<li><a href="#org4bd0382">12.2. 高级</a></li>
<li><a href="#org6245c85">12.3. 实践</a></li>
<li><a href="#org37727d9">12.4. 原理</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd9caa57" class="outline-2">
<h2 id="orgd9caa57"><span class="section-number-2">1</span> 简介</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgb22b6bc" class="outline-3">
<h3 id="orgb22b6bc"><span class="section-number-3">1.1</span> 起源</h3>
</div>
<div id="outline-container-org7e13537" class="outline-3">
<h3 id="org7e13537"><span class="section-number-3">1.2</span> 优点</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>上手方便，用来写程序原型特别方便。</li>
<li>代码库很全面。</li>
</ul>
</div>
</div>
<div id="outline-container-orgb74a78b" class="outline-3">
<h3 id="orgb74a78b"><span class="section-number-3">1.3</span> 特性</h3>
<div class="outline-text-3" id="text-1-3">
<p>
动态类型以及多态性是 Python 语言灵活性的根源。每个对象都有两个标准的头部信息：类型标志符和引用计数器。
</p>
</div>
</div>
<div id="outline-container-org63e7bbf" class="outline-3">
<h3 id="org63e7bbf"><span class="section-number-3">1.4</span> 语言文化</h3>
</div>
<div id="outline-container-org545bb9d" class="outline-3">
<h3 id="org545bb9d"><span class="section-number-3">1.5</span> 编码规范</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org4407ab7" class="outline-4">
<h4 id="org4407ab7"><span class="section-number-4">1.5.1</span> 注释</h4>
</div>
</div>
</div>
<div id="outline-container-org2db4294" class="outline-2">
<h2 id="org2db4294"><span class="section-number-2">2</span> 安装运行</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org692254c" class="outline-3">
<h3 id="org692254c"><span class="section-number-3">2.1</span> 安装</h3>
</div>
<div id="outline-container-org5441cc9" class="outline-3">
<h3 id="org5441cc9"><span class="section-number-3">2.2</span> 运行</h3>
</div>
</div>
<div id="outline-container-orgc7ff8bd" class="outline-2">
<h2 id="orgc7ff8bd"><span class="section-number-2">3</span> 相关工具</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org015357a" class="outline-3">
<h3 id="org015357a"><span class="section-number-3">3.1</span> 标准命令</h3>
</div>
<div id="outline-container-org25866bc" class="outline-3">
<h3 id="org25866bc"><span class="section-number-3">3.2</span> 集成开发</h3>
</div>
<div id="outline-container-orga0370c0" class="outline-3">
<h3 id="orga0370c0"><span class="section-number-3">3.3</span> 代码检查</h3>
</div>
<div id="outline-container-orgdc4bb45" class="outline-3">
<h3 id="orgdc4bb45"><span class="section-number-3">3.4</span> 构建编译</h3>
</div>
<div id="outline-container-org30adfd5" class="outline-3">
<h3 id="org30adfd5"><span class="section-number-3">3.5</span> 代码调试</h3>
</div>
<div id="outline-container-orgd5b236b" class="outline-3">
<h3 id="orgd5b236b"><span class="section-number-3">3.6</span> 自动测试</h3>
</div>
<div id="outline-container-org4aad955" class="outline-3">
<h3 id="org4aad955"><span class="section-number-3">3.7</span> 性能分析</h3>
</div>
<div id="outline-container-org0d24c06" class="outline-3">
<h3 id="org0d24c06"><span class="section-number-3">3.8</span> 文档系统</h3>
</div>
<div id="outline-container-org77b229c" class="outline-3">
<h3 id="org77b229c"><span class="section-number-3">3.9</span> 包管理系统</h3>
<div class="outline-text-3" id="text-3-9">
</div>
<div id="outline-container-org0647645" class="outline-4">
<h4 id="org0647645"><span class="section-number-4">3.9.1</span> easy_install</h4>
</div>
<div id="outline-container-orgf216a16" class="outline-4">
<h4 id="orgf216a16"><span class="section-number-4">3.9.2</span> pip</h4>
<div class="outline-text-4" id="text-3-9-2">
<p>
使用豆瓣作为软件源镜像：
</p>
<div class="org-src-container">
<pre class="src src-sh">vim $<span style="color: #ff8700;">HOME</span>/.config/pip/pip.conf
</pre>
</div>


<pre class="example">
[global]
timeout = 60
index-url = https://pypi.doubanio.com/simple
</pre>
</div>
</div>
</div>
