content/python/python-summary.org
*** 继承
    #+BEGIN_SRC python
# -*- coding:utf-8-*-
class Base:
    cls_var = "cls_var"

    def __init__(self, name):
        print("construct Foo instance: " + name)
        self.instance_var = "instance var"

    @classmethod
    def cls_method(cls):
        return type(cls).__name__ + " class method"

    @classmethod
    def call_static_method(cls):
        return "from class method call " + cls.static_methold()

    @staticmethod
    def static_methold():
        return "base static method "

    @staticmethod
    def call_cls_methold():
        return "from static method call " + Base.cls_method()

    def instance_method(self):
        return type(self).__name__ + " instance method"


class Derive(Base):
    @classmethod
    def cls_method(cls):
        return type(cls).__name__ + " class method"

    @staticmethod
    def static_methold():
        return "child static method"


if __name__ == "__main__":
    b1 = Base("foo1")
    b2 = Base("foo2")

    print(b1.instance_var is b2.instance_var)  # True
    print(b1.cls_var is b2.cls_var)  # True
    print(b1.cls_method is b2.cls_method)  # False
    print(b1.static_methold is b2.static_methold)  # True

    print(b1.instance_method())

    print(b1.cls_method())
    print(Base.cls_method())

    print(b1.static_methold())
    print(Base.static_methold())

    print(Base.call_cls_methold())
    print(Base.call_static_method())

    d = Derive("child")
    print(d.call_static_method())
    print(d.call_cls_methold())

     #+END_SRC
**** 类变量
**** 实例变量
**** 类方法
     如果函数总需要访问类的成员，不需要访问实例成员，就将函数声明为类方法。其中第一个参数动态绑定到调用该函数的类型上。
**** 成员方法
     如果需要访问实例成员就声明为实例方法，其中第一个参数动态绑定到调用该函数的实例上。
**** 静态方法
     如果类成员和实例成员都不需要访问，就声明为静态方法。
