docs/python/python-summary.html


<div id="outline-container-org7cba7dc" class="outline-3">
<h3 id="org7cba7dc"><span class="section-number-3">3.10</span> 其他工具</h3>
</div>
</div>
<div id="outline-container-org099de71" class="outline-2">
<h2 id="org099de71"><span class="section-number-2">4</span> 工程布局</h2>
</div>
<div id="outline-container-org0e1381e" class="outline-2">
<h2 id="org0e1381e"><span class="section-number-2">5</span> 程序结构</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org705e358" class="outline-3">
<h3 id="org705e358"><span class="section-number-3">5.1</span> 函数</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org1e98a16" class="outline-4">
<h4 id="org1e98a16"><span class="section-number-4">5.1.1</span> 参数</h4>
</div>
<div id="outline-container-org7c588bf" class="outline-4">
<h4 id="org7c588bf"><span class="section-number-4">5.1.2</span> 返回值</h4>
</div>
</div>
<div id="outline-container-orgf25c067" class="outline-3">
<h3 id="orgf25c067"><span class="section-number-3">5.2</span> 标识符</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-org3d4f209" class="outline-4">
<h4 id="org3d4f209"><span class="section-number-4">5.2.1</span> 常量</h4>
<div class="outline-text-4" id="text-5-2-1">
<ul class="org-ul">
<li>数字</li>
<li>字符串</li>
<li>元组</li>
</ul>
</div>
</div>
<div id="outline-container-org6d808f9" class="outline-4">
<h4 id="org6d808f9"><span class="section-number-4">5.2.2</span> 变量</h4>
<div class="outline-text-4" id="text-5-2-2">
<ul class="org-ul">
<li>列表</li>
<li>字典</li>
</ul>
</div>
</div>
<div id="outline-container-org81ca1bd" class="outline-4">
<h4 id="org81ca1bd"><span class="section-number-4">5.2.3</span> 动态绑定</h4>
</div>
<div id="outline-container-orgeb2b3a6" class="outline-4">
<h4 id="orgeb2b3a6"><span class="section-number-4">5.2.4</span> 作用域</h4>
</div>
</div>
</div>
<div id="outline-container-orgfe3d1a6" class="outline-2">
<h2 id="orgfe3d1a6"><span class="section-number-2">6</span> 类型系统</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org794b31b" class="outline-3">
<h3 id="org794b31b"><span class="section-number-3">6.1</span> 基本类型</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org993a688" class="outline-4">
<h4 id="org993a688"><span class="section-number-4">6.1.1</span> 布尔(bool)</h4>
</div>
<div id="outline-container-org7a1e078" class="outline-4">
<h4 id="org7a1e078"><span class="section-number-4">6.1.2</span> 数字(numeric)</h4>
<div class="outline-text-4" id="text-6-1-2">
<p>
int()
</p>
</div>
</div>
<div id="outline-container-org52b2e75" class="outline-4">
<h4 id="org52b2e75"><span class="section-number-4">6.1.3</span> 字符串(string)</h4>
<div class="outline-text-4" id="text-6-1-3">
<p>
str()
</p>
</div>
</div>
</div>
<div id="outline-container-org323ebcd" class="outline-3">
<h3 id="org323ebcd"><span class="section-number-3">6.2</span> 复合类型</h3>
<div class="outline-text-3" id="text-6-2">
</div>
<div id="outline-container-org4cb1b23" class="outline-4">
<h4 id="org4cb1b23"><span class="section-number-4">6.2.1</span> 元组（tuple）</h4>
</div>
<div id="outline-container-orgf0005c6" class="outline-4">
<h4 id="orgf0005c6"><span class="section-number-4">6.2.2</span> 列表（list）</h4>
</div>
<div id="outline-container-org3f7142a" class="outline-4">
<h4 id="org3f7142a"><span class="section-number-4">6.2.3</span> 字典（dict）</h4>
</div>
</div>
<div id="outline-container-org86a2fe1" class="outline-3">
<h3 id="org86a2fe1"><span class="section-number-3">6.3</span> 默认值</h3>
</div>
<div id="outline-container-orgdf02b65" class="outline-3">
<h3 id="orgdf02b65"><span class="section-number-3">6.4</span> 类型转换</h3>
</div>
</div>
<div id="outline-container-org6004297" class="outline-2">
<h2 id="org6004297"><span class="section-number-2">7</span> 运算符</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org1f8ee3b" class="outline-3">
<h3 id="org1f8ee3b"><span class="section-number-3">7.1</span> 算数运算符</h3>
</div>
<div id="outline-container-org529854e" class="outline-3">
<h3 id="org529854e"><span class="section-number-3">7.2</span> 逻辑运算符</h3>
</div>
<div id="outline-container-org8441117" class="outline-3">
<h3 id="org8441117"><span class="section-number-3">7.3</span> 位运算符</h3>
</div>
<div id="outline-container-org0f5bec3" class="outline-3">
<h3 id="org0f5bec3"><span class="section-number-3">7.4</span> 通信操作符</h3>
</div>
</div>
<div id="outline-container-orgce900ea" class="outline-2">
<h2 id="orgce900ea"><span class="section-number-2">8</span> 表达式</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgbe6573e" class="outline-3">
<h3 id="orgbe6573e"><span class="section-number-3">8.1</span> 赋值表达式</h3>
<div class="outline-text-3" id="text-8-1">
<p>
多变量赋值
</p>
</div>
</div>
</div>
<div id="outline-container-org58362ec" class="outline-2">
<h2 id="org58362ec"><span class="section-number-2">9</span> 分支控制</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org9b966a1" class="outline-3">
<h3 id="org9b966a1"><span class="section-number-3">9.1</span> 判断</h3>
</div>
<div id="outline-container-org7caec71" class="outline-3">
<h3 id="org7caec71"><span class="section-number-3">9.2</span> 循环</h3>
</div>
<div id="outline-container-org117790f" class="outline-3">
<h3 id="org117790f"><span class="section-number-3">9.3</span> 跳转</h3>
</div>
</div>

<div id="outline-container-orgc97d1de" class="outline-2">
<h2 id="orgc97d1de"><span class="section-number-2">10</span> 编程范式</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgdcbb15c" class="outline-3">
<h3 id="orgdcbb15c"><span class="section-number-3">10.1</span> 面向对象</h3>
<div class="outline-text-3" id="text-10-1">
<p>
python 本身支持类模型。
</p>
</div>
<div id="outline-container-org01f57f7" class="outline-4">
<h4 id="org01f57f7"><span class="section-number-4">10.1.1</span> 封装</h4>
</div>
<div id="outline-container-org4e8ee95" class="outline-4">
<h4 id="org4e8ee95"><span class="section-number-4">10.1.2</span> 继承</h4>
<div class="outline-text-4" id="text-10-1-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">-*- coding:utf-8-*-</span>
<span style="color: #a1db00;">class</span> <span style="color: #00d7af;">Base</span>:
    <span style="color: #c6c6c6; background-color: #303030;">cls_var</span> = <span style="color: #ff4ea3;">"cls_var"</span>

    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">__init__</span>(<span style="color: #a1db00;">self</span>, name):
        <span style="color: #a1db00;">print</span>(<span style="color: #ff4ea3;">"construct Foo instance: "</span> + name)
        <span style="color: #a1db00;">self</span>.instance_var = <span style="color: #ff4ea3;">"instance var"</span>

    <span style="color: #a1db00;">@classmethod</span>
    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">cls_method</span>(<span style="color: #a1db00;">cls</span>):
        <span style="color: #a1db00;">return</span> <span style="color: #d18aff;">type</span>(<span style="color: #a1db00;">cls</span>).__name__ + <span style="color: #ff4ea3;">" class method"</span>

    <span style="color: #a1db00;">@classmethod</span>
    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">call_static_method</span>(<span style="color: #a1db00;">cls</span>):
        <span style="color: #a1db00;">return</span> <span style="color: #ff4ea3;">"from class method call "</span> + <span style="color: #a1db00;">cls</span>.static_methold()

    <span style="color: #a1db00;">@staticmethod</span>
    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">static_methold</span>():
        <span style="color: #a1db00;">return</span> <span style="color: #ff4ea3;">"base static method "</span>

    <span style="color: #a1db00;">@staticmethod</span>
    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">call_cls_methold</span>():
        <span style="color: #a1db00;">return</span> <span style="color: #ff4ea3;">"from static method call "</span> + Base.cls_method()

    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">instance_method</span>(<span style="color: #a1db00;">self</span>):
        <span style="color: #a1db00;">return</span> <span style="color: #d18aff;">type</span>(<span style="color: #a1db00;">self</span>).__name__ + <span style="color: #ff4ea3;">" instance method"</span>


<span style="color: #a1db00;">class</span> <span style="color: #00d7af;">Derive</span>(Base):
    <span style="color: #a1db00;">@classmethod</span>
    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">cls_method</span>(<span style="color: #a1db00;">cls</span>):
        <span style="color: #a1db00;">return</span> <span style="color: #d18aff;">type</span>(<span style="color: #a1db00;">cls</span>).__name__ + <span style="color: #ff4ea3;">" class method"</span>

    <span style="color: #a1db00;">@staticmethod</span>
    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">static_methold</span>():
        <span style="color: #a1db00;">return</span> <span style="color: #ff4ea3;">"child static method"</span>


<span style="color: #a1db00;">if</span> <span style="color: #d18aff;">__name__</span> == <span style="color: #ff4ea3;">"__main__"</span>:
    <span style="color: #c6c6c6; background-color: #303030;">b1</span> = Base(<span style="color: #ff4ea3;">"foo1"</span>)
    <span style="color: #c6c6c6; background-color: #303030;">b2</span> = Base(<span style="color: #ff4ea3;">"foo2"</span>)

    <span style="color: #a1db00;">print</span>(b1.instance_var <span style="color: #a1db00;">is</span> b2.instance_var)  <span style="color: #6c6c6c; font-style: italic;"># True</span>
    <span style="color: #a1db00;">print</span>(b1.cls_var <span style="color: #a1db00;">is</span> b2.cls_var)  <span style="color: #6c6c6c; font-style: italic;"># True</span>
    <span style="color: #a1db00;">print</span>(b1.cls_method <span style="color: #a1db00;">is</span> b2.cls_method)  <span style="color: #6c6c6c; font-style: italic;"># False</span>
    <span style="color: #a1db00;">print</span>(b1.static_methold <span style="color: #a1db00;">is</span> b2.static_methold)  <span style="color: #6c6c6c; font-style: italic;"># True</span>

    <span style="color: #a1db00;">print</span>(b1.instance_method())

    <span style="color: #a1db00;">print</span>(b1.cls_method())
    <span style="color: #a1db00;">print</span>(Base.cls_method())

    <span style="color: #a1db00;">print</span>(b1.static_methold())
    <span style="color: #a1db00;">print</span>(Base.static_methold())

    <span style="color: #a1db00;">print</span>(Base.call_cls_methold())
    <span style="color: #a1db00;">print</span>(Base.call_static_method())

    <span style="color: #c6c6c6; background-color: #303030;">d</span> = Derive(<span style="color: #ff4ea3;">"child"</span>)
    <span style="color: #a1db00;">print</span>(d.call_static_method())
    <span style="color: #a1db00;">print</span>(d.call_cls_methold())

</pre>
</div>
</div>
<div id="outline-container-org13089d3" class="outline-5">
<h5 id="org13089d3"><span class="section-number-5">10.1.2.1</span> 类变量</h5>
</div>
<div id="outline-container-org64156ba" class="outline-5">
<h5 id="org64156ba"><span class="section-number-5">10.1.2.2</span> 实例变量</h5>
</div>
<div id="outline-container-org31ebaf1" class="outline-5">
<h5 id="org31ebaf1"><span class="section-number-5">10.1.2.3</span> 类方法</h5>
<div class="outline-text-5" id="text-10-1-2-3">
<p>
如果函数总需要访问类的成员，不需要访问实例成员，就将函数声明为类方法。其中第一个参数动态绑定到调用该函数的类型上。
</p>
</div>
</div>
<div id="outline-container-org8b97def" class="outline-5">
<h5 id="org8b97def"><span class="section-number-5">10.1.2.4</span> 成员方法</h5>
<div class="outline-text-5" id="text-10-1-2-4">
<p>
如果需要访问实例成员就声明为实例方法，其中第一个参数动态绑定到调用该函数的实例上。
</p>
</div>
</div>
<div id="outline-container-orgc325bd7" class="outline-5">
<h5 id="orgc325bd7"><span class="section-number-5">10.1.2.5</span> 静态方法</h5>
<div class="outline-text-5" id="text-10-1-2-5">
<p>
如果类成员和实例成员都不需要访问，就声明为静态方法。
</p>
</div>
</div>
